{
    "header": {
        "name": "Dalton Craven",
        "skip": "تخطي إلى المحتوى",
        "nav": {
            "about": "عني",
            "projects": "المشاريع",
            "skills": "المهارات",
            "hobbies": "الهوايات",
            "contact": "الاتصال",
            "github": "GitHub"
        },
        "languages": {
            "intro": "اقرأ باللغة ",
            "or": " و",
            "en": "<span dir='ltr'>English</span>",
            "fr": "<span dir='ltr'>Français</span>",
            "ar": "العربية"
        }
    },
    "sections": {
        "about": {
            "header": "عني",
            "content": "مرحبا! اسمي دالتون كرافن. أنا مهندس برمجيات وخريج حديث من جامعة كارولينا الجنوبية. أنا مناصر كبير لوصول الويب وتقنيات التعريب لضمان أن يظل الويب مفتوحًا للجميع."
        },
        "journey": {
            "header": "رحلتي",
            "content1": "لطالما كنت مفتونًا بالتكنولوجيا والطرق التي يمكن بها استخدامها لحل المشكلات. تعرفت على عالم علوم الكمبيوتر لأول مرة في المدرسة الثانوية من خلال <a href='https://hackclub.com'>نادي القرصنة</a>, شبكة من المنظمات البرمجية التي يديرها الطلاب. ثم تابعْتُ دراسة العلوم الحاسوب النظرية والتطبيقية في جامعة كارولينا الجنوبية، حيث تخرجت بامتياز مع بكالوريوس علوم الحاسوب.",
            "content2": "خلال فترة دراستي في الجامعة، كان لدي فرصة الدراسة في الخارج في باريس والتدريب في <a href='https://qantev.com'>Qantev</a>, شركة تكنولوجيا ناشئة فرنسية. كانت هذه التجارب لا تقدر بثمن في تشكيل نظرتي للعالم وتوسيع أفقي. كان بإمكاني تجربة ثقافة جديدة، وتعلم لغة جديدة، وصنع أصدقاء لمدى الحياة. كما اكتسبت تقديرًا أعمق لأهمية التعريب والوصول في تطوير البرمجيات.",
            "content3": "أعود حاليًا إلى باريس حيث أعمل كمهندس برمجيات كامل المهارات في Qantev، حيث أساعد في بناء منصة ستحدث ثورة في الطريقة التي تدير بها شركات التأمين بياناتها."
        },
        "projects": {
            "header": "المشاريع",
            "wordification": {
                "title": "Wordification: طريقة جديدة لتعليم أنماط الإملاء الإنجليزي",
                "alt": "لقطة شاشة من صفحة اللعبة من Wordification. يظهر ستة أصوات محتملة كأزرار. بالإضافة إلى ذلك، اللعبة لديها شريط تقدم وزر \"إعادة تشغيل الصوت\".",
                "description": "Wordification هو مجموعة من الألعاب الإلكترونية المصممة لتعليم الإملاء من خلال ربط الأصوات والرسوم، مما يشجع الطلاب على تعلم قواعد الإملاء الصوتية بدلاً من حفظ قوائم الإملاء الثابتة. Wordification حاليًا في مرحلة الإثبات، ولكن فريقنا يتطلع بشدة إلى إجراء تجارب فعلية ومراجعة الأقران مع الطلاب قريبًا. لقد قدمنا مؤخرًا ورقة بحثية عن Wordification إلى <a href='https://www.american-cse.org/csce2023/conferences-FECS'>المؤتمر الدولي الـ 19 للتعليم: علوم الحاسوب وهندسة الحاسوب</a>، والذي تم قبوله للنشر - نحن متحمسون لتقديم أعمالنا في يوليو. يتم بناء Wordification بواسطة Redwood و Typescript، وهو <a href='https://github.com/wordification/app'>مرئي على جيتهب</a>."
            },
            "dkms": {
                "title": "DKMS: ميزات وسائل التواصل الاجتماعي لـ Spotify",
                "alt": "لقطة شاشة من صفحة الملف الشخصي من DKMS. تظهر هذه الصفحة صورة الملف الشخصي للمستخدم واسم العرض والأغاني والفنانين الذين يستمعون إليهم الأكثر.",
                "description": "بالنسبة لمشروعي النهائي في السنة الأخيرة، قادة فريق من خمسة في تصميم وتنفيذ تطبيق فريد - واحد يثري تجربة Spotify من خلال دمج ميزات وسائل التواصل الاجتماعي. نظرًا للحمل الكبير، توليت أدوارًا متعددة - مطور، مدير devops، وسكرم ماستر. كان المنتج النهائي هو تطبيق ويب كامل الوظائف مبني بواسطة Next.js، Typescript، Firestore، و Spotify Web SDK. بعض الميزات الرئيسية تشمل القدرة على تحميل المحتوى بشكل ديناميكي، توصيات مخصصة بناءً على نشاط الاستماع للمستخدم، وتحليل الصوت للأغاني، والألبومات، والفنانين، وقوائم التشغيل. يتم نشر المشروع على <a href='https://dkms.vercel.app'>Vercel</a>، والكود <a href='https://github.com/sccapstone/dkms'>مرئي على جيتهب</a>."
            }
        },
        "skills": {
            "header": "المهارات",
            "spokenLanguages": "<strong>اللغات (المحكية):</strong> <a href='/' class='underline'>الإنجليزية</a>, <a href='/fr/' class='underline'>الفرنسية</a>, العربية, اللغة الأمريكية للإشارة (ASL)",
            "techLanguages": "<strong>اللغات (التقنية):</strong> TypeScript, JavaScript, GraphQL, Python, Java, C++, HTML, CSS, Visual Basic .NET, PHP, SQL",
            "frameworks": "<strong>الأطُر:</strong> <abbr title='هذا ما استخدمته لهذا الموقع!'>Astro</abbr>, React, Next, Redwood, Gatsby, WordPress",
            "certifications": "<strong>الشهادات:</strong> أساسيات التسويق الرقمي، Google — <em>معتمد في أبريل 2020</em>, Microsoft Office Specialist (MOS) Master 2016 — <em>معتمد في خريف 2018</em>, MOS Word 2016 Expert, MOS Excel 2016 Expert — <em>معتمد في خريف 2018</em>"
        },
        "contact": {
            "header": "اتصل بي",
            "americanPhone": "<strong>الهاتف الأمريكي:</strong> <a href='tel:+15138136421'>+1 513 813 6421</a>",
            "email": "<strong>البريد الإلكتروني:</strong> <a href='mailto:daltoncraven@proton.me'> daltoncraven@proton.me</a>",
            "github": "<strong>GitHub:</strong> <a href='https://github.com/cravend'>cravend</a>",
            "gitlab": "<strong>GitLab:</strong> <a href='https://gitlab.com/cravend'>cravend</a>",
            "linkedin": "<strong>LinkedIn:</strong> <a href='https://linkedin.com/in/daltoncraven'>daltoncraven</a>",
            "gpg": "<strong>GPG:</strong> <a href='https://github.com/cravend.gpg'>0xFF3FA75081B3B98C</a>"
        }
    },
    "footer": {
        "content": "© 2023 دالتون كرافن"
    }
}