{
    "header": {
        "name": "دالتون كرافن",
        "skip": "تخطي إلى المحتوى",
        "nav": {
            "about": "عني",
            "projects": "المشاريع",
            "skills": "المهارات",
            "hobbies": "الهوايات",
            "contact": "الاتصال",
            "github": "GitHub"
        },
        "languages": {
            "en": "English",
            "fr": "French",
            "ar": "Arabic"
        }
    },
    "sections": {
        "about": {
            "header": "عني",
            "content": "مرحبا! اسمي دالتون كرافن. أنا مهندس برمجيات وخريج حديث من جامعة كارولينا الجنوبية. أنا أؤيد بشدة تقنيات الوصول والتوطين على الويب لضمان بقاءه متاحًا للجميع."
        },
        "journey": {
            "header": "رحلتي",
            "content1": "لقد أسرتني دائمًا التكنولوجيا والطريقة التي يمكن استخدامها لحل المشكلات. بدأت رحلتي في عالم علوم الكمبيوتر في المدرسة الثانوية عندما انضممت إلى <a href='https://hackclub.com'>Hack Club</a>، شبكة من منظمات البرمجة التي يديرها الطلاب. توجهت بعد ذلك لاستكشاف علوم الكمبيوتر النظرية والتطبيقية بشكل أعمق في جامعة كارولينا الجنوبية، حيث تمكنت من التخرج بأعلى الشهادات مع بكالوريوس في علوم الكمبيوتر.",
            "content2": "خلال وقتي في USC، كان لدي الفرصة للدراسة في الخارج في باريس والتدريب في <a href='https://qantev.com'>Qantev</a>, ناشئة تكنولوجية فرنسية. كانت هذه التجارب ذات قيمة كبيرة في تشكيل نظرتي للعالم وتوسيع آفاقي. استطعت تجربة ثقافة جديدة، تعلم لغة جديدة، وصنع أصدقاء مدى الحياة. كما اكتسبت تقديرًا أعمق لأهمية التوطين والوصول في تطوير البرمجيات.",
            "content3": "أعمل حاليًا في باريس كمهندس برمجيات بدوام كامل في Qantev، حيث أساعد في بناء منصة ستثور على الطريقة التي تدير بها شركات التأمين بياناتها. بالإضافة إلى ذلك، أعمل على بعض المشاريع الشخصية، بما في ذلك إنشاء موقع ويب يحتوي على أدوات للراقصين وموقع آخر يخص هوايتي في التصوير الفوتوغرافي."
        },
        "projects": {
            "header": "المشاريع",
            "wordification": {
                "title": "Wordification: طريقة جديدة لتعليم قواعد الإملاء الإنجليزية",
                "alt": "لقطة شاشة لصفحة اللعبة من Wordification. يتم عرض ستة أصوات محتملة كأزرار. بالإضافة إلى ذلك، اللعبة لديها شريط تقدم وزر \"إعادة تشغيل الصوت\".",
                "description": "Wordification هو مجموعة من الألعاب عبر الإنترنت مصممة لتعليم الإملاء من خلال ربط الأصوات والرسوم البيانية، مما يشجع الطلاب على تعلم قواعد الإملاء الصوتية بدلاً من حفظ قوائم الإملاء الثابتة. Wordification حاليًا في مرحلة الإثبات المفهومي، ولكن فريقنا يتطلع بشوق إلى إجراء تجارب في العالم الحقيقي، تمت مراجعتها من قبل الأقران مع الطلاب قريبًا. قدمنا مؤخرًا ورقة بحثية إلى ورقة حول Wordification إلى <a href='https://www.american-cse.org/csce2023/conferences-FECS'>المؤتمر الدولي التاسع عشر للتعليم: علوم الكمبيوتر وهندسة الكمبيوتر</a>، التي تم قبولها للنشر - نحن متحمسون لتقديم عملنا في يوليو. Wordification مبني على Redwood و Typescript، وهو <a href='https://github.com/wordification/app'>مرئي على GitHub</a>."
            },
            "dkms": {
                "title": "DKMS: إضافة ميزات وسائل التواصل الاجتماعي إلى Spotify",
                "alt": "لقطة شاشة لصفحة الملف الشخصي من DKMS. هذه الصفحة تعرض صورة الملف الشخصي للمستخدم, اسم العرض, والأغاني والفنانين الذين يستمع إليهم الأكثر.",
                "description": "في مشروعي النهائي، قدت فريقًا من خمسة أشخاص في تصميم وتنفيذ تطبيق فريد - تطبيق يثري تجربة Spotify من خلال دمج ميزات وسائل التواصل الاجتماعي. نظرًا لحجم العمل الكبير، توليت أدوارًا متعددة - مطور، مدير devops، وscrum master. كان المنتج النهائي تطبيق ويب كامل الاستقلالية مبني على Next.js، Typescript، Firestore، وSpotify Web SDK. بعض الميزات الرئيسية تضمنت القدرة على تحميل المحتوى ديناميكيًا، توصيات مخصصة بناءً على نشاط الاستماع للمستخدم، وتحليل الصوت للأغاني، الألبومات، الفنانين، والقوائم التشغيل. المشروع <a href='https://dkms.vercel.app'>منشور على Vercel</a>، والكود <a href='https://github.com/sccapstone/dkms'>مرئي على GitHub</a>."
            }
        },
        "skills": {
            "header": "المهارات",
            "spokenLanguages": "<strong>اللغات (المحكية):</strong> <a href='/'>الإنجليزية</a>, <a href='/fr'>الفرنسية</a>, <a href='/ar'>العربية</a>, لغة الإشارة الأمريكية (ASL)",
            "techLanguages": "<strong>اللغات (التقنية):</strong> TypeScript, JavaScript, GraphQL, Python, Java, C++, HTML, CSS, Visual Basic .NET, PHP, SQL",
            "frameworks": "<strong>الأطر:</strong> <abbr title='هذا ما استخدمته لهذا الموقع!'>Astro</abbr>, React, Next, Redwood, Gatsby, WordPress",
            "certifications": "<strong>الشهادات:</strong> أساسيات التسويق الرقمي، Google - <em>معتمد في أبريل 2020</em>, متخصص Microsoft Office (MOS) Master 2016 - <em>معتمد في خريف 2018</em>, MOS Word 2016 Expert, MOS Excel 2016 Expert - <em>معتمد في خريف 2018</em>"
        },
        "contact": {
            "header": "اتصل بي",
            "americanPhone": "<strong>الهاتف الأمريكي:</strong> <a href='tel:+15138136421'>+1 513 813 6421</a>",
            "email": "<strong>البريد الإلكتروني:</strong> <a href='mailto:daltoncraven@proton.me'> daltoncraven@proton.me</a>",
            "github": "<strong>GitHub:</strong> <a href='https://github.com/cravend'>cravend</a>",
            "gitlab": "<strong>GitLab:</strong> <a href='https://gitlab.com/cravend'>cravend</a>",
            "linkedin": "<strong>LinkedIn:</strong> <a href='https://linkedin.com/in/daltoncraven'>daltoncraven</a>",
            "gpg": "<strong>GPG:</strong> <a href='https://github.com/cravend.gpg'>0xFF3FA75081B3B98C</a>"
        }
    },
    "footer": {
        "content": "© 2023 دالتون كرافن"
    }
}