{
    "title": "Dalton Craven | Home",
    "header": {
        "intro": {
            "title": "Dalton Craven",
            "subtitle": "Software Engineer"
        },
        "nav": {
            "intro": "Read in:",
            "options": {
                "en": "English",
                "fr": "Français",
                "ar": "<rtl>العربية</rtl>"
            }
        }
    },
    "main": {
        "welcome": "Hello! My name is Dalton Craven!",
        "content": "It’s hard to introduce myself over the internet, but here’s a little bit about me:"
    },
    "Features": {
        "header": "About Me",
        "education": {
            "header": "Education",
            "firstParagraph": "I’m a senior at the University of South Carolina. I’m pursuing a Bachelor of Science in Computer Science with a major in computer science and a minor in psychology (weird, right?). I’m also a McNair Scholar as part of UofSC’s most prestigious scholarship program, the <a href='https://sc.edu/about/offices_and_divisions/undergraduate_admissions/honors_and_scholars_programs/top_scholars/index.php'>University Top Scholars</a>."
        },
        "study_abroad": {
            "header": "Study Abroad",
            "firstParagraph": "I have had multiple study- and work-abroad experiences while at university. I studied for both semesters of 2021 at the American University of Paris, weathering lockdowns & strikes while gaining valuable life experience. While at AUP, I completed coursework in both computer science & psychology, as well as in French language and culture."
        },
        "work": {
            "header": "Work",
            "firstParagraph": "In the summer of 2021, in between my two semesters of study abroad, I completed my fifth internship at <a href='https://qantev.com'>Qantev</a>, working primarily as a front-end developer on a React-based application. I also learned Python and Pandas to single-handedly work on the \"full stack\" of a new feature.",
            "secondParagraph": "I then returned to Qantev during summer 2022, focusing on migrating our codebase from Javascript to Typescript. Over my 3–month period, I coordinated the refactoring of 55% of our files and oversaw the implementation of new TypeScript-specific best practices."
        },
        "freelance": {
            "header": "Freelance",
            "firstParagraph": "I also do freelance web development! I work primarily with small businesses (although I’m open to other opportunities), with an emphasis on providing resources and training to ensure long-term functionality.",
            "secondParagraph": "To learn more about my work, feel free to visit my <a href='/resume.pdf'>résumé</a> or contact me at the <a href='#contact'>links below</a>."
        }
    }
}