{
  "colon": ": ",
  "homepage": "Home",
  "toggle_locale": "Lire en français",
  "tagline": "Student & Developer",
  "pfp": "Profile picture",
  "view_source": "View source on",
  "greeting": "Hello! My name is",
  "intro": "It’s hard to introduce myself over the internet, but here’s a little bit about me",
  "education_header": "Education",
  "education": "I’m a junior at the University of South Carolina. I’m pursuing a Bachelor of Science in Computer Science with a major in computer science and a minor in psychology (weird, right?). I’m also a McNair Scholar as part of UofSC’s most prestigious scholarship program, the University Top Scholars.",
  "sa_header": "Study Abroad",
  "study_abroad": "I just wrapped up a year-long exchange program at the American University of Paris! I was in France for the entirety of 2021, weathering lockdowns & strikes while gaining valuable life experience. I completed coursework in both computer science & psychology, as well as in French language and culture.",
  "work_header": "Work",
  "work_1": "I recently wrapped up a full-time internship as a front-end web developer at",
  "work_2": "There, I used a variety of technologies (primarily Next/React and GraphQL) in an agile development team to routinely publish production code for our application. I was also an undergraduate teaching assistant for the spring 2020 semester, running eight sections of Linux/UNIX labs for approximately 250 students.",
  "freelance_header": "Freelancing",
  "freelance": "I also do freelance web development! I work primarily with small businesses (although I’m open for anything), with an emphasis on providing resources and training to ensure long-term functionality.",
  "skills": "Skills & Certifications",
  "spoken_languages_header": "Languages (spoken)",
  "spoken_languages": "English, French, American Sign Language (ASL)",
  "programming_languages_header": "Languages (tech)",
  "tools_header": "Tools",
  "certifications": "Certifications",
  "cert_april_2020": "Certified April 2020",
  "cert_fall_2018": "Certified Fall 2018",
  "contact": "Contact",
  "american_phone": "American Phone",
  "french_phone": "French Phone",
  "email": "Email"
}
