{
  "colon": " : ",
  "homepage": "Accueil",
  "toggle_locale": "Read in English",
  "tagline": "Étudiant & Développeur",
  "pfp": "Image de profil",
  "view_source": "Voir le code source sur",
  "greeting": "Salut ! Moi c’est",
  "intro": "C’est assez compliqué de se présenter sur internet, mais voilà ce que je peux vous dire sur moi",
  "education_header": "Éducation",
  "education": "Je suis étudiant en deuxième année à l’Université de Caroline du Sud. Je suis en licence d’informatique avec seconde spécialisation en psychologie (marrant, non ?). Je suis également récipiendaire de la bourse McNair, un des programmes de bourses les plus prestigieux des États-Unis, les « University Top Scholars ».",
  "sa_header": "Mon année à l’étranger",
  "study_abroad": "J’étudie actuellement à l’Université Américaine de Paris ! Je serai en France toute l’année 2021. Vivre loin de chez moi et expérimenter une culture différente de la mienne a toujours été un de mes objectifs. J’ai hâte de pouvoir en profiter pleinement une fois la crise sanitaire terminée.",
  "work_header": "Mes expériences professionnelles",
  "work_1": "J’ai récemment terminé un stage à temps plein en tant que développeur web front-end à",
  "work_2": "J’y ai utilisé de nombreuses technologies (principalement Next / React et GraphQL) au sein d’une équipe de développement agile où j’ai pu contribuer directement au code de l’application. J’étais également assistant d’enseignement de premier cycle au printemps 2020, enseignant huit cours sur Linux / UNIX à environ 250 étudiants.",
  "freelance_header": "Mon travail en freelance",
  "freelance": "Je fais aussi du développement web en freelance ! Je travaille principalement avec des petites entreprises (bien que je sois ouvert à tout), en mettant à disposition des ressources informatiques et en organisant des formation pour assurer une bonne productivité à long terme.",
  "skills": "Compétences & Certifications",
  "spoken_languages_header": "Langues (parlées)",
  "spoken_languages": "Anglais, Français, Langue des signes américaine (ASL)",
  "programming_languages_header": "Langues (tech)",
  "tools_header": "Outils",
  "certifications": "Certifications",
  "cert_april_2020": "Certifié en avril 2020",
  "cert_fall_2018": "Certifié à l’automne 2018",
  "contact": "Contact",
  "american_phone": "Numéro américain",
  "french_phone": "Numéro français",
  "email": "Email"
}
