{
  "colon": " : ",
  "homepage": "Accueil",
  "toggle_locale": "Read in English",
  "tagline": "Étudiant & Développeur",
  "pfp": "Image de profil",
  "view_source": "Voir le code source sur",
  "greeting": "Salut ! Moi c’est",
  "intro": "C’est assez compliqué de se présenter sur internet, mais voilà ce que je peux vous dire sur moi",
  "education_header": "Éducation",
  "education": "Je suis étudiant en troisième année à l’Université de Caroline du Sud. Je suis en licence d’informatique avec seconde spécialisation en psychologie. Je suis également récipiendaire de la bourse McNair, un des plus prestigieux programmes de bourses, les « University Top Scholars ».",
  "sa_header": "Mon année à l’étranger",
  "study_abroad": "Je viens de terminer un programme d’échange d’un an à l’Université américaine de Paris ! J’étais en France pendant toute l’année 2021, résistant aux confinements et aux grèves tout en acquérant une expérience de vie précieuse. J’ai suivi des cours d’informatique et de psychologie, ainsi que des cours de la langue et la culture françaises.",
  "work_header": "Mes expériences professionnelles",
  "work_1": "Durant l’été 2021, j’ai effectué mon cinquième stage en tant que développeur front-end chez",
  "work_2": "J’y ai travaillé dans un environnement de développement basé sur React, en créant de nouvelles fonctionnalités pour notre application. J’ai également participé à l’exécution d’une session d’assurance qualité (QA) rigoureuse avant d’expédier une nouvelle version de l’application. Enfin, j’ai appris les bases du développement back-end (à travers de Python et de Pandas), ce qui m’a permis de créer une nouvelle fonctionnalité pendant un mois et de l’exécuter seul.",
  "freelance_header": "Mon travail en freelance",
  "freelance": "Je fais aussi du développement web en freelance ! Je travaille principalement avec des petites entreprises (bien que je sois ouvert à tout), en mettant à disposition des ressources informatiques et en organisant des formation pour assurer une bonne productivité à long terme.",
  "skills": "Compétences & Certifications",
  "spoken_languages_header": "Langues (parlées)",
  "spoken_languages": "Anglais, Français, Langue des signes américaine (ASL)",
  "programming_languages_header": "Langues (tech)",
  "tools_header": "Outils",
  "certifications": "Certifications",
  "cert_april_2020": "Certifié en avril 2020",
  "cert_fall_2018": "Certifié à l’automne 2018",
  "contact": "Contact",
  "american_phone": "Numéro américain",
  "email": "Mail"
}
